УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПолучениеМетокИзбранного/КонтурЗакупки_ПолучениеМетокИзбранного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ПолучениеМетокИзбранного</name>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.КонтурЗакупки_Метки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторМетки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеМетки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПолучениеМетокИзбранного/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Заполнить табличную часть результата.
// 
// Параметры:
//  ДанныеПоиска - Структура -  Данные поиска
Процедура ЗаполнитьТабличнуюЧастьРезультата(ДанныеПоиска) Экспорт

	ТЗМеток = Новый ТаблицаЗначений;
	ТЗМеток.Колонки.Добавить("ИдентификаторМетки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));
	ТЗМеток.Колонки.Добавить("НаименованиеМетки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТЗМеток.Колонки.Добавить("Метка", Новый ОписаниеТипов("СправочникСсылка.КонтурЗакупки_Метки"));

	Если Не ДанныеПоиска["Items"] = Неопределено Тогда
		МассивМеток = ДанныеПоиска["Items"];
		Для Каждого ЭлементМетка Из МассивМеток Цикл

			НовСтрокаТЗ = ТЗМеток.Добавить();
			НовСтрокаТЗ.ИдентификаторМетки = ЭлементМетка["Id"];
			НовСтрокаТЗ.НаименованиеМетки = ЭлементМетка["Name"];
			НовСтрокаТЗ.Метка = ПолучитьСоздатьСправочникМетки(
			ЭлементМетка["Id"], ЭлементМетка["Name"]);
		КонецЦикла;

	КонецЕсли;

	Если ТЗМеток.Количество() > 0 Тогда
		ПометитьНаУдалениеУдаленныеМетки(ТЗМеток);
		Метки.Загрузить(ТЗМеток);
	КонецЕсли;
КонецПроцедуры


// Получить метки избранного.
// 
// Параметры:
//  СтраницаЗначение - Число -  Страница значение
//  ОписаниеРезультата - Строка -  Описание результата
// 
// Возвращаемое значение:
//  Булево -  Получить метки избранного
Функция ПолучитьМеткиИзбранного(СтраницаЗначение = 1, ОписаниеРезультата = "") Экспорт
	Результат = Истина;
	Метки.Очистить();

	СтруктураПоиска = ПолучитьСтруктуруПоиска();

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьМеткиИзбранного(СтруктураПоиска);
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеПоиска = РезультатHTTPЗапроса["data"];
			ЗаполнитьТабличнуюЧастьРезультата(ДанныеПоиска);
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			 НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		Результат = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Получить структуру поиска.
// 
// Возвращаемое значение:
//  Соответствие из Строка - Получить структуру поиска
Функция ПолучитьСтруктуруПоиска() Экспорт
	Результат = Новый Соответствие;

	Возврат Результат;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ПометитьНаУдалениеУдаленныеМетки(ТЗМеток)
	МассивМеток = ТЗМеток.ВыгрузитьКолонку("Метка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_Метки.Ссылка
	|ИЗ
	|	Справочник.КонтурЗакупки_Метки КАК КонтурЗакупки_Метки
	|ГДЕ
	|	Не КонтурЗакупки_Метки.ПометкаУдаления
	|	И КонтурЗакупки_Метки.Ссылка НЕ В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивМеток);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МеткаОбъект	= Выборка.Ссылка.ПолучитьОбъект();
		МеткаОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСоздатьСправочникМетки(ИдентификаторМетки, НаименованиеМетки)

	СпрМеткаПоИмени = Справочники.КонтурЗакупки_Метки.НайтиПоНаименованию(НаименованиеМетки, Истина);
	СпрМеткаПоКоду = Справочники.КонтурЗакупки_Метки.НайтиПоКоду(ИдентификаторМетки);

	НетМеткиПоИмени = СпрМеткаПоИмени.Пустая();
	НетМеткиПоКоду = СпрМеткаПоКоду.Пустая();
	Если НетМеткиПоИмени И НетМеткиПоКоду Тогда
		СпрОбъект = Справочники.КонтурЗакупки_Метки.СоздатьЭлемент();
		СпрОбъект.Код = ИдентификаторМетки;
		СпрОбъект.Наименование = НаименованиеМетки;
		СпрОбъект.Записать();

		СпрМеткаПоИмени = СпрОбъект.Ссылка;
	ИначеЕсли Не НетМеткиПоКоду Тогда
		СпрОбъект = СпрМеткаПоКоду.ПолучитьОбъект();
		СпрОбъект.Наименование = НаименованиеМетки;
		СпрОбъект.УстановитьПометкуУдаления(Ложь);
		СпрОбъект.Записать();

		СпрМеткаПоИмени = СпрОбъект.Ссылка;
	ИначеЕсли Не НетМеткиПоИмени Тогда
		СпрОбъект = СпрМеткаПоИмени.ПолучитьОбъект();
		СпрОбъект.Код = ИдентификаторМетки;
		СпрОбъект.УстановитьПометкуУдаления(Ложь);
		СпрОбъект.Записать();

		СпрМеткаПоИмени = СпрОбъект.Ссылка;
	КонецЕсли;

	Возврат СпрМеткаПоИмени;
КонецФункции
#КонецОбласти

#КонецЕсли
